10/data/attachments/35c4865f482167f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Timothy_off_Friend_82569_0</nif:username>
            <nif:friendToBeRequested>soap_friends_9ea7829f-6e42-42c6-bed8-bc3abca5e30d</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>